app/controllers/packers_controller.rb

  def index
    @packers = Packer.paginate(page: params[:page]).order('id DESC')
---
SELECT  "packers".* FROM "packers" ORDER BY id DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]

  def show
    @packer = Packer.find(params[:id])
---
SELECT  "packers".* FROM "packers" WHERE "packers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def edit
    @packer = Packer.find(params[:id])
---
SELECT  "packers".* FROM "packers" WHERE "packers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def create
    @packer = Packer.new(packer_params)
    @packers = Packer.all
    if @packer.save
---
INSERT INTO "packers" ("name", "rating_date", "team", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Paul Gamble"], ["rating_date", "2019-05-31"], ["team", "t"], ["created_at", "2018-03-07 21:25:43.994718"], ["updated_at", "2018-03-07 21:25:43.994718"]]

  def update
    @packer = Packer.find(params[:id])

    if @packer.update(packer_params)
---
SELECT  "packers".* FROM "packers" WHERE "packers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "packers" SET "team" = ?, "updated_at" = ? WHERE "packers"."id" = ?  [["team", "t"], ["updated_at", "2018-03-05 21:41:09.933846"], ["id", 6]]