app/controllers/packjobs_controller.rb

SELECT  "packjobs".* FROM "packjobs" ORDER BY id DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "packjobs"
SELECT  "rigs".* FROM "rigs" WHERE "rigs"."packjob_id" = ? LIMIT ?  [["packjob_id", 1], ["LIMIT", 1]]
---
  def index
    @packjobs = Packjob.paginate(page: params[:page]).order('id DESC')
    @rigs = Rig.all

SELECT  "packjobs".* FROM "packjobs" WHERE "packjobs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @packjob = Packjob.find(params[:id])

SELECT  "rigs".* FROM "rigs" WHERE "rigs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def new
    @packjob = Packjob.new
    @rigs = Rig.find(:all, :conditions => { :rig_status => "t" }, :order => "rig_type_number")

SELECT  "packjobs".* FROM "packjobs" WHERE "packjobs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "rigs".* FROM "rigs" WHERE "rigs"."rig_status" = ?  [["rig_status", "t"]]
---
  def edit
    @packjob = Packjob.find(params[:id])
    @rigs = Rig.find(:all, :conditions => { :rig_status => "t" }, :order => "rig_type_number")

SELECT  "rigs".* FROM "rigs" WHERE "rigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "packjobs" ("packer_id", "rig_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["packer_id", 1], ["rig_id", 1], ["created_at", "2018-03-08 10:57:32.211082"], ["updated_at", "2018-03-08 10:57:32.211082"]]
---
  def create
    @packjob = Packjob.new(packjob_params)
    @rigs = Rig.find(:all, :conditions => { :rig_status => "t" }, :order => "rig_type_number")
    if @packjob.save

SELECT  "packjobs".* FROM "packjobs" WHERE "packjobs"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
SELECT  "rigs".* FROM "rigs" WHERE "rigs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "packjobs" SET "rig_id" = ?, "updated_at" = ? WHERE "packjobs"."id" = ?  [["rig_id", 2], ["updated_at", "2018-02-18 18:10:28.031695"], ["id", 18]]
---
  def update
    @packjob = Packjob.find(params[:id])
    @rigs = Rig.find(:all, :conditions => { :rig_status => "t" }, :order => "rig_type_number")
    if @packjob.update(packjob_params)

SELECT  "packjobs".* FROM "packjobs" WHERE "packjobs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "packjobs" WHERE "packjobs"."id" = ?  [["id", 1]]
---
  def destroy
    @packjob = Packjob.find(params[:id])
    @packjob.destroy