app/controllers/packjobs_controller.rb

SELECT  "rigs".* FROM "rigs" WHERE "rigs"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT  "packers".* FROM "packers" WHERE "packers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @packjob = Packjob.find(params[:id])
    @rig = Rig.find(@packjob.rig_id)
    @packer = Packer.find(@packjob.packer_id)

SELECT "packers".* FROM "packers" WHERE "packers"."team" = ?  [["team", "t"]]
---
  def new
    @packjob = Packjob.new
    @rigs = Rig.where(rig_status: "t")
    @packers = Packer.where(team: "t")

SELECT "packers".* FROM "packers" WHERE "packers"."team" = $1  [["team", "t"]]
---
  def edit
    @packjob = Packjob.find(params[:id])
    @rigs = Rig.where(rig_status: "t")
    @packers = Packer.where(team: "t")