app/controllers/rigs_controller.rb

SELECT  "rigs".* FROM "rigs" ORDER BY id ASC LIMIT $1 OFFSET $2  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "rigs"
---
  def index
    @rigs = Rig.paginate(page: params[:page]).order('id DESC')

SELECT  "rigs".* FROM "rigs" WHERE "rigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @rig = Rig.find(params[:id])

SELECT  "rigs".* FROM "rigs" WHERE "rigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @rig = Rig.find(params[:id])

INSERT INTO "rigs" ("rig_status", "rig_type_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["rig_status", "t"], ["rig_type_number", "Sigma #1"], ["created_at", "2018-03-07 21:27:22.409920"], ["updated_at", "2018-03-07 21:27:22.409920"]]
---
  def create
    @rig = Rig.new(rig_params)
    @rigs = Rig.all
    if @rig.save

SELECT  "rigs".* FROM "rigs" WHERE "rigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "rigs" SET "rig_status" = ?, "updated_at" = ? WHERE "rigs"."id" = ?  [["rig_status", "t"], ["updated_at", "2018-02-17 03:55:05.447821"], ["id", 4]]
---
  def update
    @rig = Rig.find(params[:id])

    if @rig.update(rig_params)

SELECT  "rigs".* FROM "rigs" WHERE "rigs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "rigs" WHERE "rigs"."id" = ?  [["id", 5]]
---
  def destroy
    @rig = Rig.find(params[:id])
    @rig.destroy